**Solving LinearRegression using Mathematical eqns**

In [27]:
import pandas as pd

In [28]:
import os

In [29]:
df=pd.read_csv('hiring (3).csv')

In [30]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [31]:
df['experience'].fillna(value='zero',inplace=True)

In [32]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [33]:
df['test_score(out of 10)']=df[['test_score(out of 10)']].fillna(df['test_score(out of 10)'].mean())

In [34]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero               8.000000                           9      50000
1       zero               8.000000                           6      45000
2       five               6.000000                           7      60000
3        two              10.000000                          10      65000
4      seven               9.000000                           6      70000
5      three               7.000000                          10      62000
6        ten               7.857143                           7      72000
7     eleven               7.000000                           8      80000

In [35]:
pip install word2number

Requirement already satisfied: word2number in c:\users\aftha\anaconda3\lib\site-packages (1.1)
Note: you may need to restart the kernel to use updated packages.

In [36]:
from word2number import w2n

In [37]:
w2n.word_to_num('Hundred')

100

In [38]:
df['experience']=df['experience'].map(w2n.word_to_num)

In [39]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0               8.000000                           9      50000
1           0               8.000000                           6      45000
2           5               6.000000                           7      60000
3           2              10.000000                          10      65000
4           7               9.000000                           6      70000
5           3               7.000000                          10      62000
6          10               7.857143                           7      72000
7          11               7.000000                           8      80000

In [40]:
x=df.drop('salary($)',axis=1)

In [41]:
y=df['salary($)']

In [42]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [43]:
model=LinearRegression()
xtrain,xtest,ytrain,ytest=train_test_split(x,y,train_size=.75,random_state=1)

In [44]:
model.fit(xtrain,ytrain)

LinearRegression()

In [45]:
model.score(xtest,ytest)

0.8597238632433393

In [46]:
model.predict([[0,8,9]])

C:\Users\aftha\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([51955.99834447])

**solving using equation**

In [47]:
#Linear Regression Formula
#y=m1x1+m2x2+......+c
#m=slope
#x=independent variable
#c=y intercept

In [48]:
slope=model.coef_
slope

array([2743.26257908, 2824.91574528, 2222.3398175 ])

In [49]:
c=model.intercept_
c

9355.614024714756

In [50]:
y=slope[0]*0+slope[1]*8+slope[2]*9+c

In [51]:
y

51955.99834446875